using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace Study_CSharp_Design.Start_CSharp_
{
    internal class STackAndHeap
    {
        /*
         * Stac (стек) - это основное место в памяти, для метода Main и все переменных-значений (не ссылок). То есть полностью все
         * переменные и данные которые относятся к значениям, хранятся в стеке (данняе которые возвращают методы, хранятся в стеке,
         * а сама реализация может находится в куче)
         * 
         * Heap (куча) - это место "дополнительное" место в памяти, где хранятся дополнительные данные ссылок. То есть в стеке
         * хранится ссылка на объект/данные, которые хранятся в куче
         */
    }
}
